<?php

/*
  PHP version 5
  Copyright (c) 2002-2010 ECISP.CN
  声明：这不是一个免费的软件，请在许可范围内使用
  作者：Bili E-mail:huangqyun@163.com  QQ:6326420
  http://www.ecisp.cn	http://www.easysitepm.com
 */
$LAN = array(
    'title' => '易思ESPCMS企业网站管理系统（简称ESPCMS）软件安装包',
    'license' => '<h3>易思ESPCMS企业网站管理系统（简称ESPCMS）授权协议（适用于所有用户）</h3>
<p>版权所有 (c) 2002-2012，尔创网联科技有限公司（以下英文简称EarcLink）保留所有权利。<br /><br />感谢您选择EarcLink产品。希望我们的努力能为您提供一个强大实用和经济的企业网站解决方案。<br /><br />EarcLink为ESPCMS产品的开发商，依法独立拥有ESPCMS产品著作权。EarcLink网址为<a href="http://www.earclink.com/">Http://www.earclink.com</a> ESPCMS官网地址为：<a href="http://www.espcms.com/">http://www.espcms.com</a>。<br /><br />
ESPCMS著作权已在中华人民共和国国家版权局注册，著作权受到法律和国际公约保护（<b>计算机软件著作权登记证书：2011SR051710</b>）。使用者：无论个人或组织、盈利与否、用途如何（包括以学习和研究为目的），均需仔细阅读本协议，在理解、同意、并遵守本协议的全部条款后，方可开始使用ESPCMS软件。<br /><br />本授权协议适用且仅适用于ESPCMS系列版本，EarcLink拥有对本授权协议的最终解释权。<br /><br /><strong>I. 协议许可的权利<br /></strong><br />&nbsp;&nbsp;&nbsp; 1. 您在未支付相应许可费用或未得到EarcLink授权的情况下，禁止将本软件应用于任何商业用途。 <br />&nbsp;&nbsp;&nbsp; 2. 您可以在协议规定的约束和限制范围内修改ESPCMS源代码(如果被提供的话)或界面风格以适应您的网站要求。 <br />&nbsp;&nbsp;&nbsp; 3. 您拥有使用本软件构建的网站中全部会员资料、文章及相关信息的所有权，并独立承担与文章内容的相关法律义务。 <br />&nbsp;&nbsp;&nbsp; 4. 获得商业授权之后，您可以将本软件应用于商业用途，同时依据所购买的授权类型中确定的技术支持期限、技术支持方式和技术支持内容，自购买时刻起，在技术支持期限内拥有通过指定的方式获得指定范围内的技术支持服务。商业授权用户享有反映和提出意见的权力，相关意见将被作为首要考虑，但没有一定被采纳的承诺或保证。<br /><br /><strong>II. 协议规定的约束和限制<br /></strong><br />&nbsp;&nbsp;&nbsp; 1. 未获商业授权之前，不得将本软件用于商业用途。购买商业授权请登陆<a href="http://www.espcms.com">http://www.espcms.com</a>参考相关说明。 <br />&nbsp;&nbsp;&nbsp; 2. 不得对本软件或与之关联的商业授权进行出租、出售、抵押或发放子许可证。 <br />&nbsp;&nbsp;&nbsp; 3. 无论如何，即无论用途如何、是否经过修改或美化、修改程度如何，只要使用ESPCMS整体或任何部分，未经商业授权的情况下，页面页脚处的易思ESPCMS企业网站管理系统、Title部分的Powered by ESPCMS和相方官方链接都必须保留，而不能清除或修改。 <br />&nbsp;&nbsp;&nbsp; 4. 禁止在ESPCMS整体或任何部分基础上以发展任何派生版本、修改版本或第三方版本用于重新分发。 <br />&nbsp;&nbsp;&nbsp; 5. 如果您未能遵守本协议的条款，您的授权将被终止，所被许可的权利将被收回，并承担相应法律责任。<br /><br /><strong>III. 有限担保和免责声明<br /></strong><br />&nbsp;&nbsp;&nbsp; 1. 本软件及所附带的文件是作为不提供任何明确的或隐含的赔偿或担保的形式提供的。 <br />&nbsp;&nbsp;&nbsp; 2. 用户出于自愿而使用本软件，您必须了解使用本软件的风险，在尚未购买产品技术服务之前，我们不承诺提供任何形式的技术支持、使用担保，也不承担任何因使用本软件而产生问题的相关责任。 <br />&nbsp;&nbsp;&nbsp; 3. EarcLink不对使用本软件构建的网站中的文章或信息承担责任。 <br /><br /><br />有关ESPCMS最终用户授权协议、商业授权与技术服务的详细内容，均由EarcLink官方网站独家提供。EarcLink拥有在不事先通知的情况下，修改授权协议和服务价目表的权力，修改后的协议或价目表对自改变之日起的新授权用户生效。</p>
<p>电子文本形式的授权协议如同双方书面签署的协议一样，具有完全的和等同的法律效力。您一旦开始安装ESPCMS，即被视为完全理解并接受本协议的各项条款，在享有上述条款授予的权力的同时，受到相关的约束和限制。协议许可范围以外的行为，将直接违反本授权协议并构成侵权，我们有权随时终止授权，责令停止损害，并保留追究相关责任的权力。</p>',
    'dbname_invalid' => '数据库名称不能为空',
    'dbnameempay' => '数据库名称为空将导致数据库安装错误',
    'database_errno_2003' => '无法连接数据库，请检查数据库是否启动，数据库服务器地址是否正确',
    'database_errno_1044' => '无法创建新的数据库，请检查数据库名称填写是否正确',
    'database_errno_1045' => '无法连接数据库，请检查数据库用户名或者密码是否正确',
    'database_errno_1064' => 'SQL 语法错误',
    'install_errno_1000' => '系统已成功安装！',
    'install_errno_1045' => '警告：强制安装将导致原数据丢失，请慎重！',
     'database_connect_error' => '数据库连接失败',
     'admininfo_invalid' => '数据库名称不能为空',
     'admin_invalid' => '数据库连接失败',
	)
?>
